nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/sqi/processor/sqi_p32mz2048ecg144.h
PLIB_INLINE_API void PLIB_SQI_InterruptSignalDisableAll(SQI_MODULE_ID index)
{
     SQI_InterruptSignalDisableAll_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_InterruptSignalIsEnabled(SQI_MODULE_ID index, SQI_INTERRUPTS interruptFlag)
{
     return SQI_InterruptSignalIsEnabled_Default(index, interruptFlag);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsInterruptSignalControl(SQI_MODULE_ID index)
{
     return SQI_ExistsInterruptSignalControl_Default(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_TapDelaySet(SQI_MODULE_ID index, uint8_t sdrClkInDly, uint8_t dataOutDly, uint8_t clkOutDly)
{
     SQI_TapDelaySet_Unsupported(index, sdrClkInDly, dataOutDly, clkOutDly);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsTapDelay(SQI_MODULE_ID index)
{
     return SQI_ExistsTapDelay_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_XIPControlWord3Set(SQI_MODULE_ID index, bool initStatCheck, uint8_t initCmdCount, SQI_LANE_MODE initCmdType, uint8_t initCmd3, uint8_t initCmd2, uint8_t initCmd1)
{
     SQI_XIPControlWord3Set_Unsupported(index, initStatCheck, initCmdCount, initCmdType, initCmd3, initCmd2, initCmd1);
}

PLIB_INLINE_API uint32_t _PLIB_UNSUPPORTED PLIB_SQI_XIPControlWord3Get(SQI_MODULE_ID index)
{
     return SQI_XIPControlWord3Get_Unsupported(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsXIPControlWord3(SQI_MODULE_ID index)
{
     return SQI_ExistsXIPControlWord3_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_XIPControlWord4Set(SQI_MODULE_ID index, bool initStatCheck, uint8_t initCmdCount, SQI_LANE_MODE initCmdType, uint8_t initCmd3, uint8_t initCmd2, uint8_t initCmd1)
{
     SQI_XIPControlWord4Set_Unsupported(index, initStatCheck, initCmdCount, initCmdType, initCmd3, initCmd2, initCmd1);
}

PLIB_INLINE_API uint32_t _PLIB_UNSUPPORTED PLIB_SQI_XIPControlWord4Get(SQI_MODULE_ID index)
{
     return SQI_XIPControlWord4Get_Unsupported(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsXIPControlWord4(SQI_MODULE_ID index)
{
     return SQI_ExistsXIPControlWord4_Unsupported(index);
}

#endif
